dbnnrmn/MM32F031C8T6/svd/MM32F031xxn.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>AES</name>
			<description>Advanced Encryption Standard</description>
			<groupName>AES</groupName>
			<baseAddress>0x40026000</baseAddress>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>FBSEL</name>
							<description>Feedback selection</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>KSIZE</name>
							<description>Key size</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CHMODH</name>
							<description>AES chaining mode high bits</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAOUTEN</name>
							<description>DMA Enable managing the data output phase</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAINEN</name>
							<description>DMA Enable managing the data input phase</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCFIE</name>
							<description>Computation Complete Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRC</name>
							<description>Error Clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCFC</name>
							<description>Computation Complete Flag Clear</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHMODL</name>
							<description>AES chaining mode low bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>AES mode Of operation</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATATYPE</name>
							<description>Data type selection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>AES enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>SR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>WRERR</name>
							<description>Write Error Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDERR</name>
							<description>Read Error Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCF</name>
							<description>Computation Complete Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DINR</name>
					<displayName>DINR</displayName>
					<description>DINR</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DINR</name>
							<description>AES Data Input Register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DOUTR</name>
					<displayName>DOUTR</displayName>
					<description>DOUTR</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DOUTR</name>
							<description>AES Data Output Register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR0</name>
					<displayName>KEYR0</displayName>
					<description>KEYR0</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR0</name>
							<description>AES Key Register 0</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR1</name>
					<displayName>KEYR1</displayName>
					<description>KEYR1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR1</name>
							<description>AES Key Register 1</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR2</name>
					<displayName>KEYR2</displayName>
					<description>KEYR2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR2</name>
							<description>AES Key Register 2</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR3</name>
					<displayName>KEYR3</displayName>
					<description>KEYR3</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR3</name>
							<description>AES Key Register 3</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IVR0</name>
					<displayName>IVR0</displayName>
					<description>IVR0</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>IVR0</name>
							<description>AES initialization vector register 0</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IVR1</name>
					<displayName>IVR1</displayName>
					<description>IVR1</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>IVR1</name>
							<description>AES initialization vector register 1</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IVR2</name>
					<displayName>IVR2</displayName>
					<description>IVR2</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>IVR2</name>
							<description>AES initialization vector register 2</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IVR3</name>
					<displayName>IVR3</displayName>
					<description>IVR3</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>IVR3</name>
							<description>AES initialization vector register 3</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR4</name>
					<displayName>KEYR4</displayName>
					<description>KEYR4</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR4</name>
							<description>AES Key Register 4</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR5</name>
					<displayName>KEYR5</displayName>
					<description>KEYR5</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR5</name>
							<description>AES Key Register 5</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR6</name>
					<displayName>KEYR6</displayName>
					<description>KEYR6</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR6</name>
							<description>AES Key Register 6</description>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR7</name>
					<displayName>KEYR7</displayName>
					<description>KEYR7</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>KEYR7</name>
							<description>AES Key Register 7</description>
						</field>
					</fields>
				</register>
