dbnnrmn/MM32F031C8T6/svd/MM32F031xxn.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>BKP</name>
			<description>Backup registers</description>
			<groupName>BKP</groupName>
			<baseAddress>0x4000280C</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x3F0</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR1</name>
					<displayName>DR1</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR2</name>
					<displayName>DR2</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR3</name>
					<displayName>DR3</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR4</name>
					<displayName>DR4</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR5</name>
					<displayName>DR5</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR6</name>
					<displayName>DR6</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR7</name>
					<displayName>DR7</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR8</name>
					<displayName>DR8</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR9</name>
					<displayName>DR9</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR10</name>
					<displayName>DR10</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP</name>
			<description>comparator</description>
			<groupName>COMP</groupName>
			<baseAddress>0x40013C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>COMP1_CSR</name>
					<displayName>COMP1_CSR</displayName>
					<description>COMP1_CSR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 1 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAT</name>
							<description>Comparator 1 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 1 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 1 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 1 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP</name>
							<description>Comparator 1 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>INM</name>
							<description>Comparator 1 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 1 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP2_CSR</name>
					<displayName>COMP2_CSR</displayName>
					<description>COMP2_CSR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 2 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 2 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 2 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 2 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 2 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP</name>
							<description>Comparator 2 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>INM</name>
							<description>Comparator 2 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 2 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 2 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
