dbnnrmn/MM32F031C8T6/svd/MM32F031xxn.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SPI1</name>
			<description>Serial peripheral interface</description>
			<groupName>SPI</groupName>
			<baseAddress>0x40013000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<description>SPI1 global interrupt</description>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>TDR</name>
					<displayName>TDR</displayName>
					<description>TDR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>TXREG</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RDR</name>
					<displayName>RDR</displayName>
					<description>RDR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>RXREG</name>
							<description>Receive data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>SR</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>RXFADDR</name>
							<description>Transmit FIFO address</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TXFADDR</name>
							<description>Receive FIFO address</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RXAVL_4BYTE</name>
							<description>Receive available 4 byte data message</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFULL</name>
							<description>Transmitter FIFO full status bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXAVL</name>
							<description>Receive available byte data message</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXEPT</name>
							<description>Transmitter empty bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>ISR</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXEPT_INTF</name>
							<description>Transmitter empty interrupt flag bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFULL_INTF</name>
							<description>RX FIFO full interrupt flag bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXMATCH_INTF</name>
							<description>Receive data match the RDNR number</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERR_INTF</name>
							<description>Receive overrun error interrupt flag bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UNDERRUN_INTF</name>
							<description>SPI underrun interrupt flag bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_INTF</name>
							<description>Receive data available interrupt flag bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_INTF</name>
							<description>Transmit FIFO avialable interrupt flag bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>IER</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXEPT_IEN</name>
							<description>Transmit empty interrupt enable bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFULL_IEN</name>
							<description>Receive FIFO full interrupt enable bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXMATCH_IEN</name>
							<description>Receive data complete interrupt enable bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERR_IEN</name>
							<description>Overrun error interrupt enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UNDERRUN_IEN</name>
							<description>Transmitter underrun interrupt enable bit(SPI slave mode only)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_IEN</name>
							<description>Receive FIFO interrupt enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_IEN</name>
							<description>Transmit FIFO empty interrupt enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<displayName>ICR</displayName>
					<description>ICR</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXEPT_ICLR</name>
							<description>Transmitter empty interrupt clear bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFULL_ICLR</name>
							<description>Receiver buffer full interrupt clear bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXMATCH_ICLR</name>
							<description>Receive completed interrupt clear bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERR_ICLR</name>
							<description>Overrun error interrupt clear bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UNDERRUN_ICLR</name>
							<description>Transmitter underrun interrupt clear bit(SPI slave mode only)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_ICLR</name>
							<description>Receive interrupt clear bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_ICLR</name>
							<description>Transmitter FIFO empty interrupt clear bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<displayName>GCR</displayName>
					<description>GCR</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0004</resetValue>
					<fields>
						<field>
							<name>DWSEL</name>
							<description>Valid byte or double-word data select signal</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NSS</name>
							<description>NSS select signal that from software and hardware</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA access mode enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXTLF</name>
							<description>TX FIFO trigger level bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RXTLF</name>
							<description>RX FIFO trigger level bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RXEN</name>
							<description>Receive enable bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXEN</name>
							<description>Transmit enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Master mode bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IEN</name>
							<description>SPI interrupt enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPIEN</name>
							<description>SPI select bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<displayName>CCR</displayName>
					<description>CCR</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0008</resetValue>
					<fields>
						<field>
							<name>TXEDGE</name>
							<description>Transmit data edge select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXEDGE</name>
							<description>Receive data edge select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPILEN</name>
							<description>SPI character length bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSBFE</name>
							<description>LSI first enable bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock polarity select bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock phase select bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>BRR</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0002</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>DIVF</name>
							<description>SPI baud rate control register for baud rate</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RDNR</name>
					<displayName>RDNR</displayName>
					<description>RDNR</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>RDN</name>
							<description>The register is used to hold a count of to be received bytes in next receive process</description>
						</field>
					</fields>
				</register>
				<register>
					<name>NSSR</name>
					<displayName>NSSR</displayName>
					<description>NSSR</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00FF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>NSS</name>
							<description>Chip select output signal in Master mode</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ECR</name>
					<displayName>ECR</displayName>
					<description>ECR</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0008</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<name>EXTLEN</name>
							<description>Control SPI data length</description>
						</field>
					</fields>
				</register>
