dbnnrmn/MM32F031C8T6/svd/MM32F031xxn.svd
				<register>
					<name>DCR</name>
					<displayName>DCR</displayName>
					<description>DMA control register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DBL</name>
							<description>DMA burst length</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DBA</name>
							<description>DMA base address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAR</name>
					<displayName>DMAR</displayName>
					<description>DMA address for full transfer</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>DMAB</name>
							<description>DMA register for burst accesses</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIM2">
			<name>TIM3</name>
			<baseAddress>0x40000400</baseAddress>
			<interrupt>
				<name>TIM3</name>
				<description>TIM3 global interrupt</description>
				<value>16</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>TIM14</name>
			<description>Basic purpose timer</description>
			<groupName>TIM</groupName>
			<baseAddress>0X40014000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM14</name>
				<description>TIM14 global interrupt</description>
				<value>19</value>
			</interrupt>
			<registers>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>control register 1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CKD</name>
							<description>Clock division</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ARPE</name>
							<description>Auto-reload preload enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>URS</name>
							<description>Update request source</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDIS</name>
							<description>Update disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CEN</name>
							<description>Counter enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DIER</name>
					<displayName>DIER</displayName>
					<description>DMA/Interrupt enable register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1IE</name>
							<description>Capture/Compare 1 interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UIE</name>
							<description>Update interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1OF</name>
							<description>Capture/Compare 1 overcapture flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1IF</name>
							<description>Capture/Compare 1 interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UIF</name>
							<description>Update interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EGR</name>
					<displayName>EGR</displayName>
					<description>event generation register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1G</name>
							<description>Capture/Compare 1 generation</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UG</name>
							<description>Update generation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_Output</name>
					<displayName>CCMR1_Output</displayName>
					<description>capture/compare mode register 1 (output mode)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OC1M</name>
							<description>Output compare 1 mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC1PE</name>
							<description>Output compare 1 preload enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC1FE</name>
							<description>Output compare 1 fast enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1S</name>
							<description>Capture/Compare 2 output enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCMR1_Input</name>
					<displayName>CCMR1_Input</displayName>
					<description>capture/compare mode register 1 (input mode)</description>
					<alternateRegister>CCMR1_Output</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IC1F</name>
							<description>Input capture 1 filter</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>IC1PSC</name>
							<description>Input capture 1 prescaler</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CC1S</name>
							<description>Capture/compare 1 selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCER</name>
					<displayName>CCER</displayName>
					<description>capture/compare enable register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CC1NP</name>
							<description>Capture/Compare 1 complementary output polarity</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1P</name>
							<description>Capture/Compare 1 output polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1E</name>
							<description>Capture/Compare 1 output enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>Counter value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>prescaler</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>PSC</name>
							<description>Prescaler value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ARR</name>
					<displayName>ARR</displayName>
					<description>auto-reload register</description>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>ARR</name>
							<description>auto-reload value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR1</name>
					<displayName>CCR1</displayName>
					<description>capture/compare register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CCR1</name>
							<description>Capture/Compare 1 value</description>
						</field>
					</fields>
				</register>
