dbnnrmn/MM32F031C8T6/svd/MM32F031xxn.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="TIM16">
			<name>TIM17</name>
			<baseAddress>0x40014800</baseAddress>
			<interrupt>
				<name>TIM17</name>
				<description>TIM17 global interrupt</description>
				<value>22</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>UART1</name>
			<description>Universal asynchronous receiver transmitter</description>
			<groupName>UART</groupName>
			<baseAddress>0x40013800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<description>UART1 global interrupt</description>
				<value>27</value>
			</interrupt>
			<registers>
				<register>
					<name>TDR</name>
					<displayName>TDR</displayName>
					<description>Transmit data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>TXREG</name>
							<description>Transmit data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RDR</name>
					<displayName>RDR</displayName>
					<description>Receive data register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>RXREG</name>
							<description>Receive data register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Current status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0009</resetValue>
					<fields>
						<field>
							<name>TXBUF_EMPTY</name>
							<description>Transmit buffer empty flag bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFULL</name>
							<description>Transmit buffer full flag bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXAVL</name>
							<description>Receive valid data flag bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXC</name>
							<description>Transmit complete flag bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>Interrupt status register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RXBRK_INTF</name>
							<description>Receive frame break interrupt flag bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFERR_INTF</name>
							<description>Frame error interrupt flag bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXPERR_INTF</name>
							<description>Parity error interrupt flag bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERR_INTF</name>
							<description>Receive overflow error interrupt flag bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_INTF</name>
							<description>Receive valid data interrupt flag bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_INTF</name>
							<description>Transmit buffer empty interrupt flag bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>Interrupt enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RXBRKEN</name>
							<description>Receive frame break interrupt enable bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFERREN</name>
							<description>Frame error interrupt enable bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXPERREN</name>
							<description>Parity error interrupt enable bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERREN</name>
							<description>Receive overflow error interrupt enable bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXIEN</name>
							<description>Receive buffer interrupt enable bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXIEN</name>
							<description>Transmit buffer empty interrupt enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<displayName>ICR</displayName>
					<description>ICR</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RXBRKCLR</name>
							<description>Receive frame break interrupt clear bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFERRCLR</name>
							<description>Frame error interrupt clear bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXPERRCLR</name>
							<description>Parity error interrupt clear bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOERRCLR</name>
							<description>Receive overflow error interrupt clear bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXICLR</name>
							<description>Receive interrupt clear bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXICLR</name>
							<description>Transmit buffer empty interrupt clear bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<displayName>GCR</displayName>
					<description>Global control register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TXEN</name>
							<description>Enable transmit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXEN</name>
							<description>Enable receive</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AUTOFLOWEN</name>
							<description>Automatic flow control enable bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMODE</name>
							<description>DMA mode selection bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UARTEN</name>
							<description>UART mode selection bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<displayName>CCR</displayName>
					<description>common control register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0030</resetValue>
					<fields>
						<field>
							<name>CHAR</name>
							<description>UART width bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BRK</name>
							<description>UART transmit frame break</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPB</name>
							<description>Stop bit selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSEL</name>
							<description>Parity selection bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEN</name>
							<description>Parity enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>Baud rate register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>DIV_MANTISSA</name>
							<description>Mantissa part of UARTDIV</description>
						</field>
					</fields>
				</register>
				<register>
					<name>FRA</name>
					<displayName>FRA</displayName>
					<description>Fractional baud rate register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>DIV_Fraction</name>
							<description>Fractional part of UARTDIV</description>
						</field>
					</fields>
				</register>
